# Content:

1- Python revision

2- Introduction to Jupyter

3- Pandas and dataframe concept

# Lab notes: 
###### Anaconda: A package manager and palform for data science.
###### Jupyter: A notebook and web application to run Python, Julia and R languages.

#  **Pandas**

# Read CSV, Crosstab

In [1]:
# start with pandas
import pandas as pd # if you got an error of 'module does not exist, then download it: '!pip install pandas' or '!pip3 install pandas'

In [2]:
#read csv file

file = 'heart.csv'  # it should be in the same directory of the notebook, or you should include the file's path before its name.
table = pd.read_csv(file)

# display records, shapes and data types

In [3]:
table.head() # displays the first 5 rows by default.

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

* **display the last 3 records of the table**

In [4]:
## your code here

table.tail(3) # displays the last 5 rows by default.

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

 **display the shape and the size of the table**

* **shape**

In [5]:
## your code here

table.shape # returns (no. rows, no. columns)

(303, 14)

* **size:** total number of cells

In [6]:
## your code here

table.size # returns no. rows * no. columns

4242

* **number of samples in the dataset**

In [7]:
## your code here

len(table) # returns # rows in the table.

303

* **print columns names**

In [8]:
## your code here

table.columns    ## table.keys() gets the same result

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

* **print columns data types**

In [9]:
## your code here


table.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

# Selection

* **select the age column**

In [10]:
## your code here

table['age']  # or use: table.age

0      63
1      37
2      41
3      56
4      57
       ..
298    57
299    45
300    68
301    57
302    57
Name: age, Length: 303, dtype: int64

* **select the first 3 rows in the age column**

In [11]:
## your code here

table['age'][:3] # for [x:y], if x does not exist, then it means the beginning of the table, note that y is not included, so it returns y-1.

0    63
1    37
2    41
Name: age, dtype: int64

* **select age, fbs and target columns**

##  <font color='red'> Task 1:
    
    Create a new dataframe that contains the fitst 2 rows in the heart.csv file. Rename it as new_df. 
</font>

In [12]:
## your code here

table[["age", 'fbs', 'target']] # to select multiple columns, type them inside a list.

     age  fbs  target
0     63    1       1
1     37    0       1
2     41    0       1
3     56    0       1
4     57    0       1
..   ...  ...     ...
298   57    0       0
299   45    0       0
300   68    1       0
301   57    0       0
302   57    0       0

[303 rows x 3 columns]

* store the output in another dataframe called table 2.

In [11]:
table2 = table[["age", 'fbs', 'target']] 
table2

     age  fbs  target
0     63    1       1
1     37    0       1
2     41    0       1
3     56    0       1
4     57    0       1
..   ...  ...     ...
298   57    0       0
299   45    0       0
300   68    1       0
301   57    0       0
302   57    0       0

[303 rows x 3 columns]

* **select age, fbs and target columns and rows from 10 to 15:** use both loc and iloc

In [3]:
table[["age", 'fbs', 'target']][10:15]  # using selection

    age  fbs  target
10   54    0       1
11   48    0       1
12   49    0       1
13   64    0       1
14   58    1       1

In [13]:
## your code here #loc

table.loc[10:15,["age", 'fbs', 'target']] # dataFrame.loc[rows, columns names]

    age  fbs  target
10   54    0       1
11   48    0       1
12   49    0       1
13   64    0       1
14   58    1       1

In [14]:
## your code here #iloc  columns: 0, 5, 13


table.iloc[10:15,[0, 5, 13]] # dataFrame.iloc[rows, columns indicies]

    age  fbs  target
10   54    0       1
11   48    0       1
12   49    0       1
13   64    0       1
14   58    1       1

* select using ranges

In [19]:
import numpy as np
table.iloc[:, np.r_[0, 1, 3:7]]

     age  sex  trestbps  chol  fbs  restecg
0     63    1       145   233    1        0
1     37    1       130   250    0        1
2     41    0       130   204    0        0
3     56    1       120   236    0        1
4     57    0       120   354    0        1
..   ...  ...       ...   ...  ...      ...
298   57    0       140   241    0        1
299   45    1       110   264    0        1
300   68    1       144   193    1        1
301   57    1       130   131    0        1
302   57    0       130   236    0        0

[303 rows x 6 columns]

# value counts

###  get the number of heart attack and non heart attack samples in the data
* **use value_counts()**

In [15]:
## your code here

table.target.value_counts() # returns each existing value in the dataset with its frequency.

1    165
0    138
Name: target, dtype: int64

* **get their probabilites from the dataset**

In [16]:
## your code here

table.target.value_counts()/len(table) # Probability = # sub group / # group (total) 
#the command: table.target.value_counts(normalize = True) does the same thing.

1    0.544554
0    0.455446
Name: target, dtype: float64

##  <font color='red'> Task 2:
    
     Count the number of patiens for each chestPain (cp column) category.
</font>

* ### get the probabilities of each gender of people with heart attack

In [3]:
## your code here

table[table.target == 1].sex.value_counts()/len(table[table.target == 1])

1    0.563636
0    0.436364
Name: sex, dtype: float64

##  <font color='red'> Task 3:
    
    Get the probabilities of heart vs no heart attack in the males.
</font>

##### Save the updated dataframe (table2) as a new csv file.

In [13]:
table2.to_csv('heart2.csv', index=False)

##  <font color='red'> Task 4:
    
    Store the columns with indicies 1,2, 3 to 7 in a new dataframe "new_df" and save it in another csv file and rename it as 'new_heart.csv'.
</font>